In [12]:
#Concatena y apendiazar data sets

In [13]:
import pandas as pd

In [16]:
red_wine = pd.read_csv("../python-ml-course/datasets/wine/winequality-red.csv", sep =";")
red_wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [19]:
red_wine.columns.values

array(['fixed acidity', 'volatile acidity', 'citric acid',
       'residual sugar', 'chlorides', 'free sulfur dioxide',
       'total sulfur dioxide', 'density', 'pH', 'sulphates', 'alcohol',
       'quality'], dtype=object)

In [32]:
red_wine.shape

(1599, 12)

In [22]:
white_wine = pd.read_csv("../python-ml-course/datasets/wine/winequality-white.csv",sep=";")

In [31]:
white_wine.shape

(4898, 12)

In [25]:
white_wine.columns.values

array(['fixed acidity', 'volatile acidity', 'citric acid',
       'residual sugar', 'chlorides', 'free sulfur dioxide',
       'total sulfur dioxide', 'density', 'pH', 'sulphates', 'alcohol',
       'quality'], dtype=object)

#Ejes python
  *axis = 0 horizonral
  *axis = 1 vertical

In [39]:
wine_data = pd.concat([red_wine ,white_wine], axis= 1)

In [36]:
wine_data.shape

(4898, 24)

In [44]:
data1 = wine_data.head(10)
data2 = wine_data[300:310]
data3 = wine_data.tail(10)
wine_scramble = pd.concat([data1,data2,data3], axis =0)

## Datos distriuidos

In [45]:
data= pd.read_csv("../python-ml-course/datasets/distributed-data/001.csv")
data.head()

         Date  sulfate  nitrate  ID
0  2003-01-01      NaN      NaN   1
1  2003-01-02      NaN      NaN   1
2  2003-01-03      NaN      NaN   1
3  2003-01-04      NaN      NaN   1
4  2003-01-05      NaN      NaN   1

In [46]:
data.shape

(1461, 4)

*importar el primer fihcero
*Hacemos un bucle para recorrer los ficheros , 
   *imporante tener una consistencia en el nombre
   *importar ficheros uno a uno 
   *Cada uno de ellos debe apendizarse (Aniadirse al final )del primer fichero
   *repetimos el bucle hasya que no queden ficheros

In [70]:
filepath = "../python-ml-course/datasets/distributed-data/"

data = pd.read_csv("../python-ml-course/datasets/distributed-data/001.csv")

final_length = len(data)

for i in range(2,333):
    if i < 10:
        filename= "00"+ str(i)
    if 10 <= i < 100:
        filename = "0"+str(i)
    if i >= 100:
        filename = str(i)
     
    file = filepath + filename + ".csv"
    
    temp_data = pd.read_csv(file)
    
    final_lenght  += len(temp_data)
    
    data = pd.concat([data , temp_data], axis = 0)

In [71]:
data.shape

(772087, 4)

In [72]:
data.tail()

           Date  sulfate  nitrate   ID
726  2004-12-27      NaN      NaN  332
727  2004-12-28      NaN      NaN  332
728  2004-12-29      NaN      NaN  332
729  2004-12-30      NaN      NaN  332
730  2004-12-31      NaN      NaN  332

In [73]:
data.head()

         Date  sulfate  nitrate  ID
0  2003-01-01      NaN      NaN   1
1  2003-01-02      NaN      NaN   1
2  2003-01-03      NaN      NaN   1
3  2003-01-04      NaN      NaN   1
4  2003-01-05      NaN      NaN   1

In [74]:
final_lenght

1541983

In [75]:
##Joins de datasets

In [76]:
filepath = '../python-ml-course/datasets/athletes/'

In [78]:
data_main = pd.read_csv(filepath + 'Medals.csv'  , encoding ='ISO-8859-1')

In [79]:
data_main.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [80]:
a = data_main["Athlete"].unique().tolist()

In [81]:
len(a)

6956

In [82]:
data_country = pd.read_csv(filepath + "Athelete_Country_Map.csv", encoding="ISO-8859-1" )

In [83]:
data_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [84]:
data_country[data_country["Athlete"]== 'Aleksandar Ciric']

               Athlete                Country
1029  Aleksandar Ciric                 Serbia
1086  Aleksandar Ciric  Serbia and Montenegro

In [85]:
data_sports = pd.read_csv(filepath+ 'Athelete_Sports_Map.csv', encoding = "ISO-8859-1")

In [95]:
data_sports[(data_sports["Athlete"]=="Chen Jing") |
            (data_sports["Athlete"]=="Richard Thompson")|
            (data_sports["Athlete"]=="Matt Ryan")
           ]

               Athlete         Sport
528   Richard Thompson     Athletics
1308         Chen Jing    Volleyball
1419         Chen Jing  Table Tennis
2727         Matt Ryan        Rowing
5003         Matt Ryan    Equestrian
5691  Richard Thompson      Baseball

In [96]:
data_country_dp = data_country.drop_duplicates(subset="Athlete")

In [97]:
data_main_country = pd.merge(left = data_main , right= data_country,
                            left_on="Athlete", right_on="Athlete")

In [90]:
data_main_country.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States

In [91]:
data_main_country.shape

(8657, 9)

In [98]:
data_main_country[data_main_country["Athlete"]=="Aleksandar Ciric"]

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
1503,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia
1504,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia and Montenegro
1505,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia
1506,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia and Montenegro
1507,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia
1508,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia and Montenegro

In [99]:
data_sports_dp = data_sports.drop_duplicates(subset="Athlete")

In [100]:
len(data_sports_dp)==len(a)

True

In [101]:
data_final = pd.merge(left=data_main_country, right=data_sports_dp,
                     left_on="Athlete", right_on="Athlete")

In [102]:
data_final.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States,Swimming
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States,Swimming
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States,Swimming
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States,Swimming
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States,Swimming

# Tipos de Joins

In [106]:
from IPython.display import Image

In [108]:
import numpy as np

In [111]:
out_athletes = np.random.choice(data_main["Athlete"], size = 6 , replace = False)

In [120]:
data_country_dlt = data_country_dp[(~data_country_dp["Athlete"].isin(out_athletes)) & 
                                   (data_country_dp["Athlete"] != "Michael Phelps")]

data_sports_dlt = data_sports_dp[(~data_sports_dp["Athlete"].isin(out_athletes)) &
                                (data_sports_dp["Athlete"] != "Michael Phelps")]

data_main_dlt = data_main[(~data_main["Athlete"].isin(out_athletes)) & 
                         (data_main["Athlete"] != "Michael Phelps")]

In [121]:
len(data_country_dp) - len(data_country_dlt)

7

In [119]:
out_athletes

array(['Kristina Rangelova', 'Kosuke Hagino', 'Aleksey Kuleshov',
       'Peter Kretschmer', 'Yevgeny Kuznetsov', 'Jimmy Elmer'],
      dtype=object)

In [123]:
merged_inner = pd.merge(left = data_main , right = data_country_dlt,
                       how = "inner" ,left_on = "Athlete" , right_on = "Athlete")

In [125]:
merged_inner.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
1,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States
2,Natalie Coughlin,29.0,2012,08/12/2012,0,0,1,1,United States
3,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6,Russia
4,Alicia Coutts,24.0,2012,08/12/2012,1,3,1,5,Australia

In [130]:
merged_left  = pd.merge ( data_main , right = data_country_dlt ,
                       how ="left", left_on= "Athlete", right_on ="Athlete")

In [134]:
len(merged_left)

8618

In [138]:
data_country_jb = data_country_dlt.append(
   {
       "Athlete" : "Tomas Ruffo",
       "Country"  :"Argentina"
            },ignore_index= True
)

In [144]:
merged_outer =pd.merge(left = data_main , right = data_country_jb,
                      how="outer" , left_on = "Athlete" , right_on ="Athlete" )

In [146]:
len(merged_outer)

8619